20220420100156-veos_adp_plan_cn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>veos-adp-plan-cn</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">veos-adp-plan-cn</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4559d19">算法&#xa0;&#xa0;&#xa0;<span class="tag"><span class="veos">veos</span></span></a>
<ul>
<li><a href="#orge6b78f8">ddpg&#xa0;&#xa0;&#xa0;<span class="tag"><span class="veos">veos</span></span></a>
<ul>
<li><a href="#org941fb26"><span class="todo TODO">TODO</span> 代码重构</a></li>
</ul>
</li>
<li><a href="#org4454080">rdpg&#xa0;&#xa0;&#xa0;<span class="tag"><span class="veos">veos</span></span></a>
<ul>
<li><a href="#org34c703a"><span class="todo TODO">TODO</span> 实现与代码重构</a></li>
<li><a href="#orgc5dcc93">园区测试</a></li>
<li><a href="#orga74d182">道路测试</a></li>
</ul>
</li>
<li><a href="#org972fdd4"><span class="todo TODO">TODO</span> 离线训练编码</a></li>
<li><a href="#org927b1d9">驾驶风格聚类/分类分析</a>
<ul>
<li><a href="#org1063367"><span class="todo TODO">TODO</span> 训练接口评审</a></li>
<li><a href="#org767b3a7"><span class="todo TODO">TODO</span> 分类结果评审</a></li>
<li><a href="#org54c451a"><span class="todo TODO">TODO</span> 算法评审</a></li>
</ul>
</li>
<li><a href="#orgb45b6bb"><span class="todo TODO">TODO</span> 算法修订与选择 I</a></li>
<li><a href="#orgce73b60"><span class="todo TODO">TODO</span> 算法修订与选择 II</a></li>
</ul>
</li>
<li><a href="#org658c9bd">云端集群开发&#xa0;&#xa0;&#xa0;<span class="tag"><span class="veos">veos</span></span></a>
<ul>
<li><a href="#org19db7d9"><span class="todo TODO">TODO</span> 云端环境设置（创建 dockerfile 文件)</a></li>
<li><a href="#orgfc75039"><span class="todo TODO">TODO</span> 原始数据接口封装打包</a>
<ul>
<li><a href="#orgef0070d"><span class="todo TODO">TODO</span> 在线</a></li>
<li><a href="#org57cd4e4"><span class="todo TODO">TODO</span> 离线</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9bc22c6">集成测试&#xa0;&#xa0;&#xa0;<span class="tag"><span class="veos">veos</span></span></a>
<ul>
<li><a href="#org319bb30"><span class="todo TODO">TODO</span> remotecan</a>
<ul>
<li><a href="#org9301bf7"><span class="todo TODO">TODO</span> 在线训练</a></li>
<li><a href="#orgab8cf88"><span class="todo TODO">TODO</span> 离线训练</a></li>
<li><a href="#org3bffacb"><span class="todo TODO">TODO</span> 离线数据引擎训练</a></li>
</ul>
</li>
<li><a href="#orga019118"><span class="todo TODO">TODO</span> rdpg 园区测试</a></li>
<li><a href="#org4d261de"><span class="todo TODO">TODO</span> ddpg 道路测试 I</a></li>
<li><a href="#org3c36e14"><span class="todo TODO">TODO</span> rdpg 道路测试 I</a></li>
<li><a href="#org46b0b59"><span class="todo TODO">TODO</span> ddpg 道路测试 II</a></li>
<li><a href="#orgc6eeee7"><span class="todo TODO">TODO</span> rdpg 道路测试 II</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       125e36b4-aed3-44a7-9e48-c68a7291e004
</p>

<div id="outline-container-org4559d19" class="outline-2">
<h2 id="org4559d19">算法&#xa0;&#xa0;&#xa0;<span class="tag"><span class="veos">veos</span></span></h2>
<div class="outline-text-2" id="text-org4559d19">
</div>
<div id="outline-container-orge6b78f8" class="outline-3">
<h3 id="orge6b78f8">ddpg&#xa0;&#xa0;&#xa0;<span class="tag"><span class="veos">veos</span></span></h3>
<div class="outline-text-3" id="text-orge6b78f8">
</div>
<div id="outline-container-org941fb26" class="outline-4">
<h4 id="org941fb26"><span class="todo TODO">TODO</span> 代码重构</h4>
<div class="outline-text-4" id="text-org941fb26">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-05-13 Fri&gt;</span></span></p>
</div>
</div>
</div>
<div id="outline-container-org4454080" class="outline-3">
<h3 id="org4454080">rdpg&#xa0;&#xa0;&#xa0;<span class="tag"><span class="veos">veos</span></span></h3>
<div class="outline-text-3" id="text-org4454080">
</div>
<div id="outline-container-org34c703a" class="outline-4">
<h4 id="org34c703a"><span class="todo TODO">TODO</span> 实现与代码重构</h4>
<div class="outline-text-4" id="text-org34c703a">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-05-19 Thu&gt;</span></span></p>
</div>
</div>
<div id="outline-container-orgc5dcc93" class="outline-4">
<h4 id="orgc5dcc93">园区测试</h4>
</div>
<div id="outline-container-orga74d182" class="outline-4">
<h4 id="orga74d182">道路测试</h4>
</div>
</div>
<div id="outline-container-org972fdd4" class="outline-3">
<h3 id="org972fdd4"><span class="todo TODO">TODO</span> 离线训练编码</h3>
<div class="outline-text-3" id="text-org972fdd4">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-05-26 Thu&gt;</span></span></p>
</div>
</div>
<div id="outline-container-org927b1d9" class="outline-3">
<h3 id="org927b1d9">驾驶风格聚类/分类分析</h3>
<div class="outline-text-3" id="text-org927b1d9">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-06-15 Wed&gt;</span></span></p>
</div>
<div id="outline-container-org1063367" class="outline-4">
<h4 id="org1063367"><span class="todo TODO">TODO</span> 训练接口评审</h4>
</div>
<div id="outline-container-org767b3a7" class="outline-4">
<h4 id="org767b3a7"><span class="todo TODO">TODO</span> 分类结果评审</h4>
</div>
<div id="outline-container-org54c451a" class="outline-4">
<h4 id="org54c451a"><span class="todo TODO">TODO</span> 算法评审</h4>
</div>
</div>
<div id="outline-container-orgb45b6bb" class="outline-3">
<h3 id="orgb45b6bb"><span class="todo TODO">TODO</span> 算法修订与选择 I</h3>
<div class="outline-text-3" id="text-orgb45b6bb">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-06-30 Thu&gt;</span></span></p>
</div>
</div>
<div id="outline-container-orgce73b60" class="outline-3">
<h3 id="orgce73b60"><span class="todo TODO">TODO</span> 算法修订与选择 II</h3>
<div class="outline-text-3" id="text-orgce73b60">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-07-29 Fri&gt;</span></span></p>
</div>
</div>
</div>
<div id="outline-container-org658c9bd" class="outline-2">
<h2 id="org658c9bd">云端集群开发&#xa0;&#xa0;&#xa0;<span class="tag"><span class="veos">veos</span></span></h2>
<div class="outline-text-2" id="text-org658c9bd">
</div>
<div id="outline-container-org19db7d9" class="outline-3">
<h3 id="org19db7d9"><span class="todo TODO">TODO</span> 云端环境设置（创建 dockerfile 文件)</h3>
<div class="outline-text-3" id="text-org19db7d9">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-04-29 Fri&gt;</span></span></p>
</div>
</div>
<div id="outline-container-orgfc75039" class="outline-3">
<h3 id="orgfc75039"><span class="todo TODO">TODO</span> 原始数据接口封装打包</h3>
<div class="outline-text-3" id="text-orgfc75039">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-05-13 Fri&gt;</span></span></p>
</div>
<div id="outline-container-orgef0070d" class="outline-4">
<h4 id="orgef0070d"><span class="todo TODO">TODO</span> 在线</h4>
<div class="outline-text-4" id="text-orgef0070d">
</div>
<ul class="org-ul">
<li><a id="org4cb8a33"></a><span class="todo TODO">TODO</span> 四元组接口<br /></li>
</ul>
</div>
<div id="outline-container-org57cd4e4" class="outline-4">
<h4 id="org57cd4e4"><span class="todo TODO">TODO</span> 离线</h4>
<div class="outline-text-4" id="text-org57cd4e4">
</div>
<ul class="org-ul">
<li><a id="orga27404a"></a><span class="todo TODO">TODO</span> 数据池接口（依赖云端离线数据库接口）<br /></li>
<li><a id="orgb3bd377"></a><span class="todo TODO">TODO</span> 采样方法<br />
<div class="outline-text-5" id="text-orgb3bd377">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-05-13 Fri&gt;</span></span></p>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9bc22c6" class="outline-2">
<h2 id="org9bc22c6">集成测试&#xa0;&#xa0;&#xa0;<span class="tag"><span class="veos">veos</span></span></h2>
<div class="outline-text-2" id="text-org9bc22c6">
</div>
<div id="outline-container-org319bb30" class="outline-3">
<h3 id="org319bb30"><span class="todo TODO">TODO</span> remotecan</h3>
<div class="outline-text-3" id="text-org319bb30">
</div>
<div id="outline-container-org9301bf7" class="outline-4">
<h4 id="org9301bf7"><span class="todo TODO">TODO</span> 在线训练</h4>
<div class="outline-text-4" id="text-org9301bf7">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-05-26 Thu&gt;</span></span></p>
</div>
</div>
<div id="outline-container-orgab8cf88" class="outline-4">
<h4 id="orgab8cf88"><span class="todo TODO">TODO</span> 离线训练</h4>
<div class="outline-text-4" id="text-orgab8cf88">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-06-02 Thu&gt;</span></span></p>
</div>
</div>
<div id="outline-container-org3bffacb" class="outline-4">
<h4 id="org3bffacb"><span class="todo TODO">TODO</span> 离线数据引擎训练</h4>
<div class="outline-text-4" id="text-org3bffacb">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-06-09 Thu&gt;</span></span></p>
</div>
</div>
</div>
<div id="outline-container-orga019118" class="outline-3">
<h3 id="orga019118"><span class="todo TODO">TODO</span> rdpg 园区测试</h3>
<div class="outline-text-3" id="text-orga019118">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-05-31 Tue&gt;</span></span></p>
</div>
</div>
<div id="outline-container-org4d261de" class="outline-3">
<h3 id="org4d261de"><span class="todo TODO">TODO</span> ddpg 道路测试 I</h3>
<div class="outline-text-3" id="text-org4d261de">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-06-16 Thu&gt;</span></span></p>
</div>
</div>
<div id="outline-container-org3c36e14" class="outline-3">
<h3 id="org3c36e14"><span class="todo TODO">TODO</span> rdpg 道路测试 I</h3>
<div class="outline-text-3" id="text-org3c36e14">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-06-30 Thu&gt;</span></span></p>
</div>
</div>
<div id="outline-container-org46b0b59" class="outline-3">
<h3 id="org46b0b59"><span class="todo TODO">TODO</span> ddpg 道路测试 II</h3>
<div class="outline-text-3" id="text-org46b0b59">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-07-14 Thu&gt;</span></span></p>
</div>
</div>
<div id="outline-container-orgc6eeee7" class="outline-3">
<h3 id="orgc6eeee7"><span class="todo TODO">TODO</span> rdpg 道路测试 II</h3>
<div class="outline-text-3" id="text-orgc6eeee7">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2022-07-28 Thu&gt;</span></span></p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
